{
	// Allows you to wall cling and wall jump.
	"enableWallJump": true,
	// If you disable Wall Jump, it enables the enchantment automagically, this option disables the enchantment.
	"enableWallJumpEnchantment": false,
	// The rarity for Wall-Jump! Enchant, i.e. how often it appears in enchanting table, etc.
	"wallJumpEnchantmentRarity": "UNCOMMON",
	// Blacklists block inputted; can't Wall Jump off it, format is 'block.(mod name or minecraft).(name)', use underscores as spaces
	"blockBlacklist": [],
	// Enables Elytra Wall Cling: Clinging to the Wall with Elytra Deployed.
	"enableElytraWallCling": false,
	// Enables Invisible Wall Cling: Clinging to the Wall whilst Invisible.
	"enableInvisibleWallCling": false,
	// Classic Wall Cling which allows Crouch, the reason this can't be keybinded is because Fabric doesn't support Multi Mapping.
	"enableClassicWallCling": false,
	// Allows you to climb up without alternating walls.
	"enableReclinging": false,
	// Automagically turn the player when wall clinging.
	"enableAutoRotation": false,
	// Height of Wall Jumps
	"heightWallJump": .9,
	// Ticks wall clinged before starting wall slide.
	"delayWallClingSlide": 50,
	// Exhaustion gained per wall jump.
	"exhaustionWallJump": 0.8,
	// Allows you to jump in mid-air
	"enableDoubleJump": false,
	// If you disable Double Jump, it enables the enchantment automagically, this option disables the enchantment.
	"enableDoubleJumpEnchantment": false,
	// If you disable Wall Jump, it enables the enchantment automagically, this option disables the enchantment.
	"doubleJumpEnchantmentRarity": "RARE",
	// Changes the Jump Count for Double Jump so you can instead have a Triple Jump or even a Quadruple Jump.
	"countDoubleJump": 1,
	// Exhaustion gained per double jump.
	"exhaustionDoubleJump": 1.2,
	// Multiplier for Exhaustion gained per jump of doublejump (ONLY IF YOU WANNA BE FREAKY).
	"exhaustionDoubleJumpMultiplier": 1.0,
	// Play a rush of wind as you fall to your doom.
	"playFallingSound": true,
	// Minimum distance for fall damage sound to play; set to 3.0 to disable.
	"minFallDistance": 7.5,
	// Elytra speed boost; set to 0.0 to disable.
	"elytraSpeedBoost": 0.0,
	// Sprint speed boost; set to 0.0 to disable.
	"sprintSpeedBoost": 0.0,
	// If you disable Speed Boost, it enables the enchantment automagically, this option disables the enchantment.
	"enableSpeedBoostEnchantment": false,
	// The rarity for Speedboost Enchant, i.e. how often it appears in enchanting table, etc.
	"speedBoostEnchantmentRarity": "RARE",
	// Walk up steps even while airborne, also jump over fences.
	"enableStepAssist": false
}